import React from "react";
import Image from "next/image";
import Container from "@/components/shared/Container";
import tareqImage from "../../../../../src/assets/images/hero/hero3.jpg";
import Banner from "./_components/Banner";

const page = () => {
  return (
    <div>
      <Banner />
      <Container>
        <div className="grid grid-cols-1 md:grid-cols-2 lg:grid-cols-2 gap-10 my-16">
          {/* Profile Section */}
          <div className="bg-gradient-to-r from-red-600 to-green-600 md:sticky top-32 self-start">
            <div className="flex justify-center mt-5">
              <Image
                src={tareqImage}
                alt="Tareq Rahman"
                className="rounded-full"
              />
            </div>
            <div className="p-2 md:p-8">
              <h1 className="text-2xl md:text-4xl font-bold text-white mb-5 text-center">
              দেশনায়ক তারেক রহমান
              </h1>
              <ul className="list-disc pl-5 space-y-3 text-white">
                <li>
                  <strong>জন্ম:</strong> ২০ নভেম্বর, ১৯৬৭
                </li>
                <li>
                  <strong>রাজনৈতিক ভূমিকা:</strong> বিএনপির সিনিয়র ভাইস চেয়ারম্যান
                </li>
                <li>
                  <strong>পরিবার:</strong> জিয়াুর রহমান এবং খালেদা জিয়ার বড় ছেলে
                </li>
                <li>
                  <strong>নির্বাসন:</strong> ২০০৮ সাল থেকে লন্ডনে বসবাস করছেন
                </li>
                <li>
                  <strong>বিবাদ:</strong> বাংলাদেশে বেশ কয়েকটি আইনি চ্যালেঞ্জের সম্মুখীন হয়েছেন
                </li>
                <li>
                  <strong>বর্তমান অবস্থা:</strong> বিএনপির প্রভাবশালী নেতা, বিদেশ থেকে দলের পরিচালনা করছেন
                </li>
              </ul>
            </div>

          </div>
          {/* Content Section */}
          <div className="px-4 py-6">
            <div className="mt-10">
              <h2 className="text-2xl font-semibold mb-2">
                Early Life and Family Background
              </h2>
              <hr className="w-24 h-2 bg-gradient-to-r from-red-600 to-green-600 border-0 rounded-full mb-5" />
              <p className="text-justify">
                তারেক রহমান (জন্ম: ২০ নভেম্বর ১৯৬৭) বাংলাদেশ জাতীয়তাবাদী দল-বিএনপি-এর
                ভারপ্রাপ্ত চেয়ারম্যান। তিনি পূর্বে দলের সিনিয়র ভাইস-চেয়ারম্যান এবং
                সিনিয়র যুগ্ম মহাসচিব হিসেবে দায়িত্ব পালন করেছেন।
              </p>
            </div>

            <div className="mt-10">
              <h2 className="text-2xl font-semibold mb-2">
                বাংলাদেশের মুক্তিযুদ্ধ প্রত্যক্ষ করা
              </h2>

              <hr className="w-24 h-2 bg-gradient-to-r from-red-600 to-green-600 border-0 rounded-full mb-5" />
              <p className="text-justify">
                মি. রহমান বাংলাদেশের মুক্তিযুদ্ধের সংগ্রাম এবং রাজনৈতিক অস্থিরতা প্রত্যক্ষ করেছেন এবং এর অংশ হয়েছেন। ছোটবেলায়, তিনি তার মা বেগম খালেদা জিয়ার সঙ্গে বাংলাদেশের মুক্তিযুদ্ধের কঠিন বাস্তবতা প্রত্যক্ষ করেন। যুদ্ধ চলাকালীন, যখন তার বাবা, শহীদ রাষ্ট্রপতি জিয়াউর রহমান বীর উত্তম, ১৯৭১ সালের মার্চ মাসে বাংলাদেশের স্বাধীনতা ঘোষণা করেন এবং দেশকে মুক্ত করতে প্রতিরোধ আন্দোলন শুরু করেন, তখন তিনি, তার মা এবং তার ভাইসহ অন্যান্য বাঙালি সামরিক অফিসারদের পরিবারের সদস্যদের সঙ্গে গ্রেফতার হন। ১৬ ডিসেম্বর ১৯৭১ তারিখে, যখন তার বাবা এবং তার সহযোদ্ধারা বাংলাদেশের বিজয় অর্জন করেন, তখন তারা মুক্তি পান। ফলে, তিনি বাংলাদেশের মুক্তিযুদ্ধে লড়াইরত সবচেয়ে কনিষ্ঠ যুদ্ধবন্দীদের একজন ছিলেন।
              </p>

            </div>

            <div className="mt-10">
              <h2 className="text-2xl font-semibold mb-2">
                শিক্ষা ও রাজনৈতিক জাগরণ
              </h2>

              <hr className="w-24 h-2 bg-gradient-to-r from-red-600 to-green-600 border-0 rounded-full mb-5" />
              <p className="text-justify">
                ঢাকা বিএএফ শাহীন কলেজে প্রাথমিক শিক্ষা সম্পন্ন করার পর, ১৯৮০-এর দশকে তিনি ঢাকা বিশ্ববিদ্যালয়ের আন্তর্জাতিক সম্পর্ক বিভাগে ভর্তি হন। বিশ্ববিদ্যালয়ে তিনি সক্রেটিস, প্লেটো, অ্যারিস্টটল, হবস, লক, রুশো, ভলতেয়ার, কার্ল মার্কসসহ অন্যান্য বিশিষ্ট চিন্তাবিদদের রাজনৈতিক ভাবধারা সম্পর্কে পড়াশোনা করেন। ১৯৮৬ সালে, এরশাদ সরকারের সাজানো নির্বাচনের পূর্ব মুহূর্তে, তিনি গৃহবন্দি অবস্থা থেকে পালিয়ে প্রেস ক্লাবে গিয়ে এক সংবাদ সম্মেলনে অংশ নেন, যেখানে তিনি কিভাবে নিরাপত্তা সংস্থাগুলো তাদের পক্ষপাতমূলক নির্বাচনের বিরুদ্ধে আন্দোলনকে বাধাগ্রস্ত করার চেষ্টা করেছিল তা তুলে ধরেন। এর ফলে, তার কণ্ঠরোধ করতে, স্বৈরাচারী শাসক জেনারেল এইচ এম এরশাদের সরকার প্রায়ই তাকে এবং তার মাকে গৃহবন্দি করে রাখত।
              </p>

            </div>

            <div className="mt-10">
              <h2 className="text-2xl font-semibold mb-2">
                এরশাদ বিরোধী আন্দোলনে যোগদান
              </h2>

              <hr className="w-24 h-2 bg-gradient-to-r from-red-600 to-green-600 border-0 rounded-full mb-5" />
              <p className="text-justify">
                এরশাদ বিরোধী আন্দোলনের সময় তিনি তার মায়ের সঙ্গে রাস্তায় নেমে আসেন এবং ১৯৮৮ সালে গাবতলী উপজেলায়, বিএনপি-র একটি ইউনিটে সাধারণ সদস্য হিসেবে যোগ দেন। তিনি তৃণমূল থেকে জনগণকে সংগঠিত করেন এবং এইচ এম এরশাদ সরকারের পতনে গুরুত্বপূর্ণ ভূমিকা রাখেন।
              </p>

            </div>

            <div className="mt-10">
              <h2 className="text-2xl font-semibold mb-2">
                তৃণমূল ক্ষমতায়ন এবং গণতান্ত্রিক প্রক্রিয়া
              </h2>

              <hr className="w-24 h-2 bg-gradient-to-r from-red-600 to-green-600 border-0 rounded-full mb-5" />
              <p className="text-justify">
                ১৯৯১ সালের নির্বাচনের আগে তিনি তার মা বেগম খালেদা জিয়ার সঙ্গে দেশের প্রায় প্রতিটি জেলায় প্রচারণা চালান এবং নির্বাচনে বিজয়ী হন। তার মা বাংলাদেশের প্রথম নারী প্রধানমন্ত্রী হন। তিনি বগুড়ায়, যেখানে তিনি বিএনপি ইউনিটের নির্বাহী সদস্য ছিলেন, তৃণমূল থেকে নেতাদের নির্বাচিত করার গণতান্ত্রিক প্রক্রিয়া শুরু করেন। ১৯৯৩ সালে বগুড়া জেলা ইউনিটে তিনি একটি সম্মেলনের আয়োজন করেন, যেখানে গোপন ব্যালটের মাধ্যমে নেতৃত্ব নির্বাচন করা হয়, যা দলের অন্যান্য জেলা ইউনিটের জন্য একটি মডেল হিসেবে কাজ করে। বগুড়ায় সফল সম্মেলনের পর, তিনি অন্যান্য জেলা ইউনিটগুলোকে গণতান্ত্রিকভাবে তাদের নেতাদের নির্বাচন করতে উৎসাহিত করেন।
              </p>

            </div>

            <div className="mt-10">
              <h2 className="text-2xl font-semibold mb-2">
                ২০০১ সালের বিজয়ে উদ্ভাবন ও অবদান
              </h2>

              <hr className="w-24 h-2 bg-gradient-to-r from-red-600 to-green-600 border-0 rounded-full mb-5" />
              <p className="text-justify">
                ২০০১ সালের নির্বাচনের আগে, মি. রহমান ঢাকা শহরে একটি অফিস প্রতিষ্ঠা করেন যা স্থানীয় পর্যায়ের সমস্যাগুলি এবং সুশাসন নিয়ে গবেষণা করে। তিনি সেখানে বুদ্ধিজীবী ও নাগরিক সমাজের সদস্যদের সঙ্গে আলোচনা করেন। তার প্রচেষ্টার জন্য, বিএনপি ২০০১ সালের নির্বাচনে বিপুল বিজয় অর্জন করে। চেয়ারপারসনের পুত্র হিসেবে এবং তৃণমূলের ব্যাপক সমর্থন পাওয়া সত্ত্বেও, তিনি আত্মীয়তার ভিত্তিতে কোনো সরকারি পদ গ্রহণ করেননি এবং প্রতিনিধিদের এবং জনগণের মধ্যে ফাঁক পূরণ করে দলের তৃণমূলকে ক্ষমতায়ন করতে মনোনিবেশ করেন। দলের উন্নয়নে তার প্রচেষ্টার স্বীকৃতিস্বরূপ, ২০০২ সালে বিএনপি’র স্থায়ী কমিটি তাকে সিনিয়র যুগ্ম মহাসচিব হিসেবে নিযুক্ত করে।
              </p>

            </div>

            <div className="mt-10">
              <h2 className="text-2xl font-semibold mb-2">
                সারা দেশে তৃণমূল ফোরাম
              </h2>

              <hr className="w-24 h-2 bg-gradient-to-r from-red-600 to-green-600 border-0 rounded-full mb-5" />
              <p className="text-justify">
                ২০০৫ সালে, মি. রহমান একটি সারা দেশে তৃণমূল ফোরাম convene করেন যা বাংলাদেশের প্রতিটি উপজেলা বা উপ-জেলা অন্তর্ভুক্ত ছিল। তিনি প্রতিটি উপ-জেলায় সফর করেন, তৃণমূল নেতাদের এবং কর্মীদের সঙ্গে কথা বলেন, স্থানীয়দের সঙ্গে এককভাবে আলোচনা করেন, নিজের মতামত প্রদান করেন এবং সমর্থকদের মতামত শোনেন, এবং জনগণের কাছে বিএনপি’র দর্শন প্রচার করেন। তিনি কৃষকদের জন্য সরকারী ভর্তুকি, বৃদ্ধদের জন্য ভাতা, পরিবেশগত ভারসাম্য রক্ষা করতে প্লাস্টিক ব্যাগ বিরোধী আন্দোলন এবং মেয়েদের শিক্ষার্থীদের জন্য স্টাইপেন্ড বিতরণ সম্পর্কে জনগণকে অবহিত করেন, যা বিদ্যালয়ে লিঙ্গ অনুপাত বাড়িয়ে দিয়েছে। তিনি ব্যক্তিগতভাবে কমপক্ষে ১৮,০০০ সাড়া-পত্রে স্বাক্ষর করেন যা সম্মেলনের রেজিস্ট্রেন্টদের জন্য পাঠানো হয়। এই সাড়া-পত্রগুলিতে আঞ্চলিক সমস্যাগুলি উল্লেখ করা হয় এবং সম্ভাব্য সমাধান প্রস্তাবিত হয়।
              </p>

            </div>

            <div className="mt-10">
              <h2 className="text-2xl font-semibold mb-2">
                সামরিক শাসনের লক্ষ্য
              </h2>

              <hr className="w-24 h-2 bg-gradient-to-r from-red-600 to-green-600 border-0 rounded-full mb-5" />
              <p className="text-justify">
                ২০০৭ সালে, আওয়ামী লীগ-সমর্থিত সামরিক শাসনের অবৈধ ক্ষমতা দখলের পর তারেক রহমানকে নতুন প্রতিহিংসাপরায়ণ শাসন দ্বারা লক্ষ্যবস্তু করা হয়। পরবর্তীতে সিস্টেমের অভ্যন্তরীণরা সামরিক শাসন নিয়ে একটি বইয়ের লেখককে প্রকাশ করেছেন যে, তত্ত্বাবধায়ক সরকারের প্রধানরা বেশ কয়েকটি অফিসের কর্মকর্তাদের, দুর্নীতিবিরোধী কমিশনসহ, মি. রহমানের বিরুদ্ধে মিথ্যা অভিযোগ দায়ের করতে বাধ্য করেছিলেন। এছাড়া, আটক অবস্থায় তাকে নির্যাতন করা হয় এবং উন্নত চিকিৎসার জন্য তাকে দেশ ছাড়তে হয়।
              </p>

            </div>

            <div className="mt-10">
              <h2 className="text-2xl font-semibold mb-2">
                বিএনপি’র নেতৃত্ব ও গণতন্ত্রপন্থী আন্দোলন
              </h2>

              <hr className="w-24 h-2 bg-gradient-to-r from-red-600 to-green-600 border-0 rounded-full mb-5" />
              <p className="text-justify">
                ২০০৯ সালে তিনি বিএনপি’র সিনিয়র ভাইস-চেয়ারম্যান নির্বাচিত হন এবং ধীরে ধীরে বিএনপি’র পুনর্গঠনে যুক্ত হন। ২০১৮ সালে, যখন তার মা, প্রাক্তন তিনবারের প্রধানমন্ত্রী বেগম খালেদা জিয়া মিথ্যা অভিযোগে কারাগারে ছিলেন, তিনি দলের ভারপ্রাপ্ত চেয়ারম্যান হিসেবে মনোনীত হন। তখন থেকেই তিনি স্বৈরাচারী শেখ হাসিনার বিরুদ্ধে গণতন্ত্রপন্থী আন্দোলনের নেতৃত্ব দিয়ে আসছেন।
              </p>

            </div>

            <div className="mt-10">
              <h2 className="text-2xl font-semibold mb-2">
                ব্যক্তিগত জীবন
              </h2>

              <hr className="w-24 h-2 bg-gradient-to-r from-red-600 to-green-600 border-0 rounded-full mb-5" />
              <p className="text-justify">
                ১৯৯৪ সালে, তারেক রহমানের বিয়ে হয় ডা. জুবায়দা রহমানের সঙ্গে, যিনি প্রাক্তন বাংলাদেশ নৌবাহিনীর প্রধান এবং পরবর্তীতে দুইবারের মন্ত্রী রিয়ার অ্যাডমিরাল মাহবুব আলী খানের কন্যা। জুবায়দা রহমান প্রশিক্ষণে একজন যোগ্য হৃদরোগ বিশেষজ্ঞ এবং ঢাকা মেডিকেল কলেজে পড়াশোনা করেছেন। তাদের একটি কন্যা রয়েছে, যার নাম জাইমা জার্নাজ রহমান।
              </p>

            </div>
          </div>
        </div>
      </Container>
    </div>
  );
};

export default page;
